text = input()
char = '.,:;!?–—\'\"()*/'
clearing = ''.join(tex.strip(char) for tex in text)
print(clearing)





# Было темно в гостиной. Лаптев, не садясь и держа шляпу в руках, стал извиняться за беспокойство; он спросил, что делать, чтобы сестра спала по ночам, и отчего она так страшно худеет, и его смущала мысль, что, кажется, эти самые вопросы он уже задавал доктору сегодня во время его утреннего визита.




# Было темно в гостиной Лаптев не садясь и держа шляпу в руках стал извиняться за беспокойство он спросил что делать чтобы сестра спала по ночам и отчего она так страшно худеет и его смущала мысль что кажется эти самые вопросы он уже задавал доктору сегодня во время его утреннего визита


# Да, именно так трактуется текст в лингвистике. Это продукт человеческой речи, и его главное предназначение - коммуникация, то есть передача информации. Соответственно, текст не связан исключительно с письменной речью, устное сообщение - это тоже текст.



# Да именно так трактуется текст в лингвистике Это продукт человеческой речи и его главное предназначение - коммуникация то есть передача информации Соответственно текст не связан исключительно с письменной речью устное сообщение - это тоже текст